<!-- add-pr-comment:add-pr-comment -->

## Terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # digitalocean_container_registry.webb_and_wallace_container_registry[0m will be created
[0m  [32m+[0m[0m resource "digitalocean_container_registry" "webb_and_wallace_container_registry" {
      [32m+[0m[0m created_at             = (known after apply)
      [32m+[0m[0m endpoint               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m name                   = "webb-and-wallace-container-registry"
      [32m+[0m[0m region                 = "ams3"
      [32m+[0m[0m server_url             = (known after apply)
      [32m+[0m[0m storage_usage_bytes    = (known after apply)
      [32m+[0m[0m subscription_tier_slug = "starter"
    }

[1m  # digitalocean_kubernetes_cluster.billtime_k8s_cluster[0m will be created
[0m  [32m+[0m[0m resource "digitalocean_kubernetes_cluster" "billtime_k8s_cluster" {
      [32m+[0m[0m cluster_subnet       = (known after apply)
      [32m+[0m[0m created_at           = (known after apply)
      [32m+[0m[0m endpoint             = (known after apply)
      [32m+[0m[0m ha                   = false
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m ipv4_address         = (known after apply)
      [32m+[0m[0m kube_config          = (sensitive value)
      [32m+[0m[0m name                 = "billtime-k8s-cluster"
      [32m+[0m[0m region               = "lon1"
      [32m+[0m[0m registry_integration = false
      [32m+[0m[0m service_subnet       = (known after apply)
      [32m+[0m[0m status               = (known after apply)
      [32m+[0m[0m surge_upgrade        = true
      [32m+[0m[0m tags                 = [
          [32m+[0m[0m "BillTime",
          [32m+[0m[0m "staging",
          [32m+[0m[0m "terraform",
        ]
      [32m+[0m[0m updated_at           = (known after apply)
      [32m+[0m[0m urn                  = (known after apply)
      [32m+[0m[0m version              = "1.27.2-do.0"
      [32m+[0m[0m vpc_uuid             = (known after apply)

      [32m+[0m[0m node_pool {
          [32m+[0m[0m actual_node_count = (known after apply)
          [32m+[0m[0m auto_scale        = false
          [32m+[0m[0m id                = (known after apply)
          [32m+[0m[0m name              = "worker-pool"
          [32m+[0m[0m node_count        = 2
          [32m+[0m[0m nodes             = (known after apply)
          [32m+[0m[0m size              = "s-1vcpu-2gb"
          [32m+[0m[0m tags              = [
              [32m+[0m[0m "BillTime",
              [32m+[0m[0m "staging",
              [32m+[0m[0m "terraform",
            ]
        }
    }

[1m  # digitalocean_project.billtime_project[0m will be created
[0m  [32m+[0m[0m resource "digitalocean_project" "billtime_project" {
      [32m+[0m[0m created_at  = (known after apply)
      [32m+[0m[0m description = "A staging environment for the billtime app."
      [32m+[0m[0m environment = "Staging"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m is_default  = false
      [32m+[0m[0m name        = "billtime-staging"
      [32m+[0m[0m owner_id    = (known after apply)
      [32m+[0m[0m owner_uuid  = (known after apply)
      [32m+[0m[0m purpose     = "Web Application"
      [32m+[0m[0m resources   = (known after apply)
      [32m+[0m[0m updated_at  = (known after apply)
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```